{"data":{"markdownRemark":{"html":"<p>Today I received a message on LinkedIn from one of my connections.</p>\n<p>Here’s a screencap of the message preview from my iPhone:</p>\n<p><em>Screencap somehow got deleted, please enjoy this cat noping into a cardboard box</em> 🙃</p>\n<p><img src=\"../../images/SocialMedia.jpg\" alt=\"Social Media\"></p>\n<img src=\"http://localhost:8000/static/ByeCat-9eee79419e1a3ba8dd16e9e7b2e79b32.gif\" alt=\"placeholder image\" />\n<p>We chatted briefly on LinkedIn, did a little Q&#x26;A and I left the door open for any future questions.</p>\n<h2>What This Means To Me</h2>\n<p>I was definitely happy to learn that another person became inspired through following my journey as a self-taught front-end developer. Maybe to someone else this might seem like a simple exchange of words, but to me it’s what I live for — inspiring that is.</p>\n<p>Mini-rant: Creating Live Genuine Project is in the top 3 most rewarding things I’ve ever done. Now, with this blog, I hope to spread visibility to the transgender community and connect with all our allies on a larger scale. I don’t want to feel limited by any one thing (like t-shirts). With a blog, I can speak about things that matter — like work, finances and family. There are enough t-shirts in this world, we need more hearts.</p>\n<p>So, if I can reach a person, whether it be locally or half a world away, and inspire them to reach for things they wouldn’t have otherwise AND bring awareness to equality — well by my standards that’s a life well-lived.</p>\n<h2>Okay, </rant> 😅</h2>\nAt the end of the day, I wanted to write about my pleasant surprise. Thank you for encouraging me to keep at it. I hope you go forward in the direction your heart tells you to!","frontmatter":{"title":"A Self-Taught Developer and LinkedIn","date":"May 28, 2019"},"timeToRead":1}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/front-end-development/a-self-taught-front-end-developer-and-linkedin/","previous":{"fields":{"slug":"/blog/notes/pandas-and-bananas/"},"frontmatter":{"title":"Notes Title"}},"next":{"fields":{"slug":"/blog/front-end-development/fe-post-two/"},"frontmatter":{"title":"Front-end Post Two"}}}}