{"data":{"markdownRemark":{"html":"<p>Today I received a message on LinkedIn from one of my connections. Here’s a screencap of the message preview from my iPhone:</p>\n<p><em>The screencap somehow got deleted, please enjoy this cat noping into a cardboard box instead</em> 🙃</p>\n<img src=\"https://media.giphy.com/media/b9TLVAyi8U6wE/giphy.gif\" class=\"placeholder image\" />\n<p>To summarize what the screencap was about, my friend on LinkedIn sent me a message congratulating and encouraging me on breaking into the tech scene as a self-taught developer. They said watching my progress and achievements inspired them to go into the field and learn on their own.</p>\n<p>We chatted briefly on LinkedIn and did a little Q&#x26;A. At the end of the conversation, I left the door open for any future questions.</p>\n<h2>What This Means To Me</h2>\n<p>I was definitely happy to learn that another person became inspired through following my journey as a self-taught front-end developer. Maybe to someone else this might seem like a simple exchange of words, but it really inspired me. I worked so hard to get here, and sometimes I'm so hard on myself thinking I'm not even any good.</p>\n<p>My friends message was a reminder that I have accomplished something worth praise. That said, I want to encourage anyone reading this to take a moment and realize how far you've come. Nice work, friend.</p>\n<h2>Okay, mini-rant over 😅</h2>\n<p>At the end of the day, I wanted to write about my pleasant surprise. Thank you for encouraging me to keep at it. I hope you go forward in the direction that makes you happy!</p>","frontmatter":{"title":"A Self-Taught Developer and LinkedIn","date":"May 28, 2019","category":"Development","tags":["Front End Development","Code"]},"timeToRead":1}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/development/a-self-taught-front-end-developer-and-linkedin/","previous":{"fields":{"slug":"/blog/self-improvement/how-to-be-more-productive/"},"frontmatter":{"title":"How to Be More Productive: 3 Simple Hacks"}},"next":null}}