{"data":{"markdownRemark":{"html":"<p>You are thinking about leveling up your business or digital presence by launching a WordPress website. You know that having a website significantly increases the likelihood of your business to not only survive but to thrive as well.</p>\n<p>You also know that your digital presence on today’s popular social media platforms is just for rent.</p>\n<p>In other words, these popular networks, for whatever reason, may lose their active user-base and become a ghost town like many platforms before have (Myspace, LiveJournal, etc). If and when that happens, where will your digital presence survive and live?</p>\n<h2>You Need a Website</h2>\n<p>Now, you’re convinced that you need a website and you start to lurk the internet for answers. The thing is after you’ve done all your research on how to make a website, you’ve run into some questions: Which Content Management System (CMS) should I use? Can I code my website myself?</p>\n<p>And after a couple more hours of research, you've thrown coding from scratch by the wayside.</p>\n<p>Next, you have a variety of CMS options choose from. There are many platforms that make it possible to build a website and don’t require coding skills: WIX, Squarespace, Shopify, Drupal – just to name a few. But which platform should you choose?</p>\n<p>This article will explain the benefits of choosing WordPress.</p>\n<h2>Benefits of Using WordPress</h2>\n<ol>\n<li>\n<p>It’s completely FREE. I mean, c’mon, who doesn’t like free. That’s my kinda overhead cost.</p>\n</li>\n<li>\n<p>It offers thousands of free themes, removing the need to hire a developer and/or designer, which can be quite costly. Many, if not all, of these themes are built to be mobile-friendly, so your WordPress website will look pretty on all screen sizes from desktop to smartphone.</p>\n</li>\n<li>\n<p>It has a large and active support community who regularly contribute to forums and YouTube.</p>\n</li>\n<li>\n<p>There are many free and useful third-party plugins that are compatible with WordPress.</p>\n</li>\n<li>\n<p>They have a FREE e-commerce plugin. This will allow you to offer your physical or digital (or both) products online for purchase. No more brick &#x26; mortar, no more rental fees, no more insurance fees, the list of “no mores” goes on.</p>\n</li>\n<li>\n<p>They provide an option to export and import your theme/content.</p>\n</li>\n<li>\n<p>It has the option to enable custom domains (for FREE, you just have to buy the domain name which is usually around $10).</p>\n</li>\n<li>\n<p>Google allows WordPress websites to display in their search results. This is really important for organic traffic to your site!</p>\n</li>\n</ol>\n<p>The above benefits listed are all absolutely free, with the exception of buying a domain name of course.</p>\n<h2>WordPress Theme Customization</h2>\n<p>Later on down the road, should you desire further customized development work beyond the in-dashboard customization options WordPress offers, there are plenty of competent WordPress developers around for hire.</p>\n<p>They know the power and popularly that WordPress holds (over 30% of websites today are powered by WordPress).</p>\n<p><img src=\"https://i0.wp.com/www.connorocampo.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-04-at-5.04.30-PM.png?w=1318&ssl=1\"\nalt=\"33% of the web uses WordPress, from hobby blogs to the biggest news sites online.\"\nwidth=\"400\"\n/></p>\n<p>Because of this, many developers have invested in learning WordPress theming and its main language PHP. It’s safe to say that you’ll be taken care of if you were to ever need help with your WordPress website.</p>\n<h2>Buying a Theme</h2>\n<p>In the event that you buy a theme from a place like Theme Forest, there is often an option to purchase theme support (usually for 6 months at a time). Theme support is a service where you receive assistance with any theme customization you have (e.g. Can you change the color of this? Can you move this element here?) via support tickets.</p>\n<p>In my experience, once a support ticket is submitted, response times were anywhere from 24 – 48 hours. This pretty fast support service if you ask me.</p>\n<p>If you buy a theme, I recommend purchasing theme support with it before hiring a developer. They already know the code well and can help you get what you need to be done faster. This will also be more cost-effective for you.</p>\n<p>If you need a lot of custom work, hire a developer as theme support only helps with their own theme.</p>\n<p>As someone working in tech (I’m a Front End Developer), it may sound weird that I’m telling you not to hire someone like me right away. Ultimately, I want to help those who want to help themselves. I want to help the hustlers who are operating on sweat equity and know-how. And the truth is, WordPress can suite most business owners and entrepreneur needs.</p>\n<p>In fact, many well-known and respected companies run their websites on WordPress.</p>\n<h2>Here are just a few:</h2>\n<p>Websites Powered by WordPress</p>\n<p><img src=\"https://i2.wp.com/www.connorocampo.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-04-at-5.15.50-PM.png?w=994&ssl=1\"\n alt=\"Websites Powered by WordPress\"\n width=\"400\"\n/></p>\n<p>So, unless you want something fancy, all you really need to operate a website is WordPress. I encourage you to ask questions, learn from free resources (literally just Google it) and bring your business online. Start your WordPress website today.</p>","frontmatter":{"title":"8 Reasons For Making a WordPress Website","date":"March 04, 2019"},"timeToRead":3}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/front-end-development/8-reasons-to-make-a-wordpress-site/","previous":{"fields":{"slug":"/blog/front-end-development/first-front-end-development-job/"},"frontmatter":{"title":"My First Front-End Developer Job 🎉"}},"next":{"fields":{"slug":"/blog/personal-development/how-to-get-organized-and-increase-productivity-levels/"},"frontmatter":{"title":"How to Get Organized and Increase Productivity Levels"}}}}