{"data":{"markdownRemark":{"html":"<p>How does one get organized and increase productivity levels? In a tech world where like happens fast, it’s easy for fine, yet important details to get lost in the shuffle. We’re an on-the-go society and are constantly juggling thoughts, one mental note after the other.</p>\n<p>Even with the help of modern technology like Google Calendar or Trello boards, we all know what it’s like to have bad cell phone reception that prevents us from swiftly getting online to check or update these apps.</p>\n<p> In recent years, I’ve started utilizing two specific tools to get and stay organized. You probably have one of these already. In fact, if you’re reading this article on your phone, I’m certain you have it.</p>\n<p>These tools have helped me stay organized and in return have increased my focus and productivity levels significantly.</p>\n<h2>Two Important Organizational Tools To Increase Productivity</h2>\n<p>We’ll start with the one you probably have, which is a cell phone … well, sort of. It’s an app that you probably already have installed on your phone.</p>\n<h2>#1 Notes App</h2>\n<p>It’s a notes app! (Notes app for Apple, Google Keep for Android.) Both of these run offline which makes that easy to access and use when you need to take a mental note out of your head and save it for later.</p>\n<p>Doing this allows you to free up much-needed headspace or “bandwidth” for you to carry on and about your day while staying sharp on the immediate matters at hand.</p>\n<h3>Organize With Lists</h3>\n<p>I found the best way to get and stay organized is to break lists up into categories. So, instead of having one giant To Do List for all the thoughts in your head, break them up.</p>\n<p>Here are some common list examples: Grocery List, House Work List, Ideas List.</p>\n<p>Let’s talk about how this maximizes productivity. Let’s take our Grocery List for example.</p>\n<p>If there was no list to go off of, it’d be a battle to remember what you needed when you thought of it at 10 AM or 3 PM or right when you pulled up to the grocery store parking lot. If you made a list for it on your phone and saved what you needed throughout the day, you'd probably have a relatively quick grocery run.</p>\n<p>Making a list for grocery store trips have eliminated the classic situation where you go to the grocery store needing something only to come back home, groceries in-hand, but you forget to buy what you went there for in the first place.</p>\n<p>The reason this particular situation bugs me so much is that I value my time so much and that just means another trip to the grocery store—that’s time spent driving in traffic, navigating the store, and waiting in line.</p>\n<h3>#2 Dry-erase Board</h3>\ns\nThis is my favorite one because it’s not on a screen (I work with computer screens all day). I love dry-erase boards!\n<p>They’re great for flexible, on-the-fly notes (lists included)!</p>\n<p>Keeping track of how many months left in my apartment lease\nHow many months until I hit my money goals\nInspirational quotes\nDentist appointments\nErrands\nI write anything down that I think is important and want to be organized about. The keys to maintaining a frugal living being organized and focused.</p>\n<p>Dry-erase boards or whiteboards are great organizational tools and mind-hacking tools. I have two of them hanging in my apartment right now. I love having them physically presented to me every day to remind me what and why I am working so hard.</p>\n<p>Every day I stare my goals in the face and work my ass off to accomplish them.</p>\n<p>I recommend this one because it’s super sturdy and easy to mount.</p>\n<h2>Productivity Levels Are Over 9000!</h2>\n<p><img src=\"https://vignette.wikia.nocookie.net/dragonball/images/4/4b/VegetaItsOver9000-02.png/revision/latest?cb=20100724145819\"\nclass=\"placeholder\"\n/></p>\n<p>Start making lists out of your mental notes by using a simple notes app on your phone and utilizing the note-taking flexibility and in-your-face presence that dry erase boards have to offer.</p>","frontmatter":{"title":"How to Get Organized and Increase Productivity Levels","date":"April 24, 2019"},"timeToRead":3}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/personal-development/how-to-get-organized-and-increase-productivity-levels/","previous":{"fields":{"slug":"/blog/front-end-development/8-reasons-to-make-a-wordpress-site/"},"frontmatter":{"title":"8 Reasons For Making a WordPress Website"}},"next":{"fields":{"slug":"/blog/personal-development/how-to-be-more-productive/"},"frontmatter":{"title":"How to Be More Productive: 3 Simple Hacks"}}}}