{"data":{"markdownRemark":{"html":"<p>An extra $100 a month sure does sound good, doesn’t it?</p>\n<p>In a year, that equates to an extra $1,200 saved! Compound that savings year-over-year and you’ve got yourself a nice cash pile starting to build up. The best part is, you can make this happen without having to get a part-time job.</p>\n<h2>$100+ Saved Is a Few Clicks Away</h2>\n<p>By unsubscribing from unnecessary monthly subscriptions that you don’t need … or worse, that you don’t even use, you can save over $100 every month! Monthly subscriptions fees seem like small amounts of money, especially when you’re only paying $5 to $20 a month per subscription (iTunes, Netflix, gym membership). But, let’s see what those subscriptions are really costing you.</p>\n<p>Do this exercise to get a better view of your monthly subscriptions: try listing them all out on a scoreboard. Include the name of the subscription service and fee. As you tally up the services, you’ll get the cost of what your paying per month in subscriptions. This cost is usually in excess of $100 😲. </p>\n<h2>The Average American</h2>\n<p>The average American is a natural consumer of products and services. It’s how we were raised and even given praise for when we’d purchase high-priced items.</p>\n<p>Here’s an example of how an average American’s subscription services rack up:</p>\n<p><u>Monthly Subscription Service Fees</u></p>\n<ul>\n<li>iTunes\t$9.99</li>\n<li>Netflix\t$12.99</li>\n<li>Hulu\t$11.99</li>\n<li>Commercial gym + year gym maintenance fee\t$19.99 + maintenance yearly fee ($40)</li>\n<li><b>Total\t$95 plus tax</b></li>\n</ul>\n<p>…and that’s without cable which despite having subscribed to streaming services, some people still have.</p>\n<p>Most Americans have memberships to places like Costco or Amazon.com which I have elected to leave off of the table above because those are places where you benefit financially while paying for necessities.</p>\n<h2>But Cat, I Need to Go to the Gym</h2>\n<p>I hear you.</p>\n<p>Exercise is SO important for maintaining both mental and physical health, but there are other options besides the gym where you can break a sweat. Go for a walk, jog, or run around the neighborhood.</p>\n<p>Does the area you live in have a community gym? I bet it has a pool, too. There are also many public parks that have calisthenics equipment built into the grounds. Challenge yourself to think creatively and you will find a new way to exercise, for free!</p>\n<h2>Unsubscribe to Save</h2>\n<p>By simply unsubscribing to services that you don’t need, you’ll find yourself with an extra $100+ a month saved. You can use that money to pay down debt, grow an emergency fund, or invest in your retirement.</p>\n<p>All of these options are scenarios where your hard-earned money is better spent to serve you. Having unsubscribed from Netflix and a gym membership myself, I can confidently say that after a short adjustment period, I don’t miss them.</p>\n<p>When you’re living a frugal lifestyle, you realize where your hard-earned dollars are going. You pinpoint what it is exactly what you’re consuming, and you begin to ask yourself:</p>\n<p>Is this product or service serving me for the better?</p>\n<p>Is it worth it to purchase this as opposed to investing it in my future?</p>\n<p>Saving $100+ a month can be easy if you ask yourself these two questions. The choice to unsubscribe to save $$$ is up to you.</p>","frontmatter":{"title":"How to Save $100 Every Month","date":"June 01, 2019"},"timeToRead":2}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/personal-finance/how-to-save-100-every-month/","previous":{"fields":{"slug":"/blog/front-end-development/a-self-taught-front-end-developer-and-linkedin/"},"frontmatter":{"title":"A Self-Taught Developer and LinkedIn"}},"next":null}}