{"data":{"markdownRemark":{"html":"<p><b>TL;DR</b>: In 2016, I medically transitioned from female-to-male. After three years of negative health and health insurance repercussions I started to make the transition back hormonally as well as updating my legal name and gender marker back to what it was at birth. Because of legal obstructions in the legal name change process, I'm keeping my current name but still moving forward with changing my gender marker back.</p>\n<h2>Catherine and Connor, Let Me Explain</h2>\n<p>Around July this year I went public on my social media accounts stating that I'd be changing my name and gender marker back to what they were at birth: Catherine/Female.</p>\n<p>Among the slew of reasons for the transition back, I succinctly declared that the main reason was for health and health insurance reasons - and it still is. Frankly, dealing with health insurance has been the biggest pain in the ass. To this day, I'm STILL waiting to resolve denied claims all the way back from June this year.</p>\n<p>So, I told my friends and family what all has been going on and about my interest in changing my legal information back. Really, changing my gender marker would've rid all the problems I've been having with health insurance, but I figured it'd be a nice sort of reset to go back to what my name was at birth. Anyway, my friends and family understood and showed support for any decisions I had moving forward. They just wanted me to be happy and healthy.</p>\n<h2>Filing for a name change was the first step</h2>\n<p>In September, I filed a petition for a name change to start the legal process. I went through the all the steps on <a href=\"https://www.floridanamechange.org/\">https://www.floridanamechange.org/</a>. This is an expensive process that requires a letter of recommendation from an MD, a letter of recommendation from a psychologist, and court filing fees. Mind you, I don't have health insurance anymore, so all doctors appointments were paid out-of-pocket.</p>\n<p>Now, two months later, I get a letter in the mail from the appointed judge requesting further documentation. I don't even know if more filing fees are associated with these but I do know that if I were to file and submit them, it'd just take more time - probably two more months - in this awful personal identity limbo.</p>\n<h2>Making the decision to keep my current legal name</h2>\n<p>When I got the letter from the judge, I made the decision to stick with my current legal name, Connor, almost instantly. I still really love the name and feel comfortable wearing it. For good measure, I took a night to sleep on it and woke up with the same conviction to keep my current legal name.</p>\n<p>I am, however, still changing my gender marker back. As I said earlier, this step is key to undoing all future problems with health insurance, so this is a must. After the weekend is over, I'll be headed to the social security office to get this process started.</p>\n<h2>Looking for a great, supportive company to work for</h2>\n<p>All of this legal stuff in the air hasn't stopped me from finding work. I've applied to two awesome companies in particular that I hope to hear back from.</p>\n<p>But, if I have any connections on here that know of a company hiring and think I may be a good fit with their company mission and culture, then please share this post with them.</p>\n<p>I've already made the name change updates to my Gatsby/React site and my LinkedIn URL.</p>\n<p>Website: <a href=\"https://connorocampo.github.io/website/\">https://connorocampo.github.io/website/</a></p>\n<p>LinkedIn: <a href=\"https://www.linkedin.com/in/connorocampo/\">https://www.linkedin.com/in/connorocampo/</a></p>\n<p>Thank you for reading all the way through and for supporting me in this strange dilemma. It has been a tough year but I am persevering.</p>\n<h2>Stack Overflow's Developer Survey Demographics for 2019</h2>\n<p>For anyone interested in what the 2019 developer demographics are among race, gender, and sexual orientation, click the link below:</p>\n<p><a href=\"https://insights.stackoverflow.com/survey/2019#demographics\">https://insights.stackoverflow.com/survey/2019#demographics</a></p>\n<p><b>From the article</b>:</p>\n<p>\"This year, 1.2% of respondents identified as transgender, about double from last year.\"</p>\n<p>I am sympathetic to the fact that a lot of recruiters, employers, and so on have not worked with a trans person (knowingly at least). So, I want to extend another thank you for remaining open-minded and kind. And on that note, I'll finish this post positively.</p>\n<p>Cheers and Happy Holidays,</p>\n<p>Connor Ocampo</p>","frontmatter":{"title":"Catherine and Connor, Let Me Explain","date":"November 18, 2019"},"timeToRead":3}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/blog/personal-development/catherine-and-connor-let-me-explain/","previous":{"fields":{"slug":"/blog/personal-finance/how-to-save-100-every-month/"},"frontmatter":{"title":"How to Save $100 Every Month"}},"next":null}}