{"data":{"allMarkdownRemark":{"totalCount":6,"edges":[{"node":{"id":"c0aa1306-458f-5e56-aa0c-2c82de343164","frontmatter":{"title":"A Self-Taught Developer and LinkedIn","date":"May 28, 2019"},"fields":{"slug":"/blog/front-end-development/a-self-taught-front-end-developer-and-linkedin/"},"excerpt":"Today I received a message on LinkedIn from one of my connections. Here’s a screencap of the message preview from my iPhone: The screencap somehow got deleted, please enjoy this cat noping into a cardboard box instead 🙃To summarize what the screencap was about, my friend on…","timeToRead":1}},{"node":{"id":"dd0e63c2-42ec-514c-98bf-70469415613f","frontmatter":{"title":"How to Be More Productive: 3 Simple Hacks","date":"May 04, 2019"},"fields":{"slug":"/blog/personal-development/how-to-be-more-productive/"},"excerpt":"If you’re wondering how to be more productive, this article is for you. As someone who works on a laptop for my day job and my side hustles, I know first-hand how easy it is for distractions to pop up on our screens and suck valuable time away from work.Two main distractions I’d…","timeToRead":2}},{"node":{"id":"ddc368de-9ef9-5385-b2c2-b1d1c981401c","frontmatter":{"title":"How to Get Organized and Increase Productivity Levels","date":"April 24, 2019"},"fields":{"slug":"/blog/personal-development/how-to-get-organized-and-increase-productivity-levels/"},"excerpt":"How does one get organized and increase productivity levels? In a tech world where like happens fast, it’s easy for fine, yet important details to get lost in the shuffle. We’re an on-the-go society and are constantly juggling thoughts, one mental note after the other.Even with…","timeToRead":3}},{"node":{"id":"c5db346c-9f8b-5d1b-a639-0dc305c77309","frontmatter":{"title":"8 Reasons For Making a WordPress Website","date":"March 04, 2019"},"fields":{"slug":"/blog/front-end-development/8-reasons-to-make-a-wordpress-site/"},"excerpt":"You are thinking about leveling up your business or digital presence by launching a WordPress website. You know that having a website significantly increases the likelihood of your business to not only survive but to thrive as well.You also know that your digital presence on…","timeToRead":3}},{"node":{"id":"4811c560-a0d9-5506-b7ea-1ec36e194575","frontmatter":{"title":"My First Front-End Developer Job 🎉","date":"January 19, 2019"},"fields":{"slug":"/blog/front-end-development/first-front-end-development-job/"},"excerpt":"This is an update from my post about a non-technical interview tip that led me to get my first Front-end Developer job.If you’ve read the above linked post, you’ve learned how I prepped for an interview that led me to land my first formally employed full-time gig as a Front-end…","timeToRead":2}},{"node":{"id":"acd45c80-3a35-5347-a5db-225e52d053b7","frontmatter":{"title":"A Non-Technical Job Interview Tip","date":"November 08, 2018"},"fields":{"slug":"/blog/front-end-development/a-non-technical-interview-tip/"},"excerpt":"Here is an easy-to-overlook, non-technical job interview tip that can boost your chances of landing your dream job. This tip can help both the interviewee and the hiring authority better maneuver through the interview process. It also aids in making every minute of an interview…","timeToRead":4}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"limit":3,"skip":0,"numPages":2,"currentPage":1}}